# Pandas

## Building Panda DataFrame

In [3]:
import pandas as pd

In [4]:
data = {
    'Name' : ["Alice" , "Ram" , "Sita" , "David"],
    'Age' : [25,30,11,15],
    'City' : ["New York", "Pokhara" , "Jhumka" , "Biratnagar"]
}

In [6]:
df = pd.DataFrame(data)
print(df)

    Name  Age        City
0  Alice   25    New York
1    Ram   30     Pokhara
2   Sita   11      Jhumka
3  David   15  Biratnagar

In [7]:
df

    Name  Age        City
0  Alice   25    New York
1    Ram   30     Pokhara
2   Sita   11      Jhumka
3  David   15  Biratnagar

In [8]:
print(df.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    4 non-null      object
 1   Age     4 non-null      int64
 2   City    4 non-null      object
dtypes: int64(1), object(2)
memory usage: 228.0+ bytes
None

In [9]:
print(df.describe())

             Age
count   4.000000
mean   20.250000
std     8.770215
min    11.000000
25%    14.000000
50%    20.000000
75%    26.250000
max    30.000000

In [10]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    4 non-null      object
 1   Age     4 non-null      int64
 2   City    4 non-null      object
dtypes: int64(1), object(2)
memory usage: 228.0+ bytes

In [11]:
df.describe()

             Age
count   4.000000
mean   20.250000
std     8.770215
min    11.000000
25%    14.000000
50%    20.000000
75%    26.250000
max    30.000000

In [13]:
data = {
    'Name' : ["Alice" , "Ram" , "Sita" , "David"],
    'Age' : [25,30,11,15],
    'City' : ["New York", "Pokhara" , "Jhumka" , "Biratnagar"]
}

df = pd.DataFrame(data)
df.describe()
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    4 non-null      object
 1   Age     4 non-null      int64
 2   City    4 non-null      object
dtypes: int64(1), object(2)
memory usage: 228.0+ bytes

### Column Access garne tarika

In [15]:
df["Name"]  #Column ko name

0    Alice
1      Ram
2     Sita
3    David
Name: Name, dtype: object

In [17]:
print(df.Name)  #Using dot operator

0    Alice
1      Ram
2     Sita
3    David
Name: Name, dtype: object

## Label-based Indexing (loc)

In [19]:
"""label bhaneko Row ko index ho in Pandas"""

"""
List ma Slicing garda Start Index Include huncha Tara End Index Exclude huncha
Tara
loc ma chai Start and End both Index Include huncha

-> loc le square bracket use garcha eg df.loc["a"]
"""

'\nList ma Slicing garda Start Index Include huncha Tara End Index Exclude huncha\nTara\nloc ma chai Start and End both Index Include huncha\n'

In [21]:
import pandas as pd

df = pd.DataFrame({
    'Name' : ["Alice" , "Ram" , "Sita" , "David"],
    'Age' : [25,30,11,15],
    'City' : ["New York", "Pokhara" , "Jhumka" , "Biratnagar"]
}, index =['a','b','c','d']) #esari index dina milcha
#otherwise default ma 0 1 2 3 huncha

df.to_csv("file_name.csv", index=False) #esle chai CSV File banaucha

#index=True huda chai chuttai Index value ko
#Column bancha without column name
#junle pachi issue lyauna sakcha

#so better to keep index=False

loc le Index use garera row ko information dincha

In [22]:
df.loc["a"]

Name       Alice
Age           25
City    New York
Name: a, dtype: object

In [24]:
#Row ko selected Column ko information chaeyeko bela

print(df.loc["a", ["Name", "Age"]])

Name    Alice
Age        25
Name: a, dtype: object

In [28]:
print(df.loc['a':'c']) #Index a to c samma ko row chaeda

    Name  Age      City
a  Alice   25  New York
b    Ram   30   Pokhara
c   Sita   11    Jhumka

In [32]:
print(df.loc[df["Age"] > 20])

    Name  Age      City
a  Alice   25  New York
b    Ram   30   Pokhara

In [34]:
print(df.loc[df["City"]=="Jhumka"])

   Name  Age    City
c  Sita   11  Jhumka

# Integer Position-based Indexing (iloc)

esma End Index is exclusive like List in Python
list jastai ho

In [35]:
import pandas as pd

df = pd.DataFrame({
    'Name' : ["Alice" , "Ram" , "Sita" , "David"],
    'Age' : [25,30,11,15],
    'City' : ["New York", "Pokhara" , "Jhumka" , "Biratnagar"]
}, index =['a','b','c','d'])

In [36]:
print(df.iloc[1])

Name        Ram
Age          30
City    Pokhara
Name: b, dtype: object

In [37]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, a to d
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    4 non-null      object
 1   Age     4 non-null      int64
 2   City    4 non-null      object
dtypes: int64(1), object(2)
memory usage: 128.0+ bytes

In [38]:
print(df.iloc[[1,2]])
#Double square bracket means tesko Row haru bhaneko bujne

   Name  Age     City
b   Ram   30  Pokhara
c  Sita   11   Jhumka

In [40]:
print(df.iloc[1,1]) #1st Row ko 1st Item Bhancha esle
#tara loc ma mildaina esari

30

In [44]:
print(df.iloc[2 , [0 , 2]]) #2nd Row ko Oth Column and 
#2nd Column Lina bhano

Name      Sita
City    Jhumka
Name: c, dtype: object

In [46]:
print(df.iloc[: , [0,2]]) #1st Value le kati ota row bhancha
#2nd value le kun kun Column bhancha

    Name        City
a  Alice    New York
b    Ram     Pokhara
c   Sita      Jhumka
d  David  Biratnagar

# Data Filtering

In [58]:
import pandas as pd

df = pd.DataFrame({
    'Name' : ["Alice" , "Ram" , "Sita" , "David"],
    'Age' : [25,30,51,15],
    'City' : ["New York", "Pokhara" , "Jhumka" , "Biratnagar"]
})

df

    Name  Age        City
0  Alice   25    New York
1    Ram   30     Pokhara
2   Sita   51      Jhumka
3  David   15  Biratnagar

In [60]:
adults = df[df.Age >=30]
adults

   Name  Age     City Country
1   Ram   30  Pokhara     USA
2  Sita   51   Jhumka     USA

In [54]:
adult_from_pokhara = df[ (df.Age>=20) & (df.City =="Pokhara")]
adult_from_pokhara

  Name  Age     City
1  Ram   30  Pokhara

In [61]:
df["Country"] = "USA"
df

    Name  Age        City Country
0  Alice   25    New York     USA
1    Ram   30     Pokhara     USA
2   Sita   51      Jhumka     USA
3  David   15  Biratnagar     USA

### Column ko Name lai Rename Garnu parda

In [66]:
df = df.rename(columns = {"Name":"Full_Name"})
df

  Full_Name  Age        City Country
0     Alice   25    New York     USA
1       Ram   30     Pokhara     USA
2      Sita   51      Jhumka     USA
3     David   15  Biratnagar     USA

### Sorting Garnu Parda

In [68]:
df_sort = df.sort_values(by="Age" , ascending=False)
#ascending=False huda chai Descending order ma sort garcha
df_sort

  Full_Name  Age        City Country
2      Sita   51      Jhumka     USA
1       Ram   30     Pokhara     USA
0     Alice   25    New York     USA
3     David   15  Biratnagar     USA

## Grouping and Aggregration

In [69]:
import pandas as pd
import numpy as np

In [72]:

df = pd.DataFrame({
    "Category" : ['A','B','A','A','A','B','B','C'],
    "Value":[10,20,33,44,55,66,77,88]
})
df

  Category  Value
0        A     10
1        B     20
2        A     33
3        A     44
4        A     55
5        B     66
6        B     77
7        C     88

In [74]:
grouped = df.groupby("Category").agg(["sum","mean","count","min","max"])
grouped

         Value
           sum       mean count min max
Category
A          142  35.500000     4  10  55
B          163  54.333333     3  20  77
C           88  88.000000     1  88  88

In [75]:
df = pd.DataFrame({
    "Category" : ['A','B','A','A','A','B','B','C'],
    "Value1":[10,20,33,44,55,66,77,88],
    "Value2":[100,200,330,440,550,660,770,880]
})

In [76]:
""" aggregation vaneko Multiple Data Lai Single Value Out Dineyy"""

' aggregation vaneko Multiple Data Lai Single Value Out Dineyy'

# Handling Missing Data

In [77]:
import pandas as pd
import numpy as np

df = pd.DataFrame({
    'A' : [1,2,np.nan , 4],
    'B': [5,np.nan , np.nan,8],
    'C' : ['a','b','c', None ]
}
    )

df

     A    B     C
0  1.0  5.0     a
1  2.0  NaN     b
2  NaN  NaN     c
3  4.0  8.0  None

In [78]:
print(df.isna())

       A      B      C
0  False  False  False
1  False   True  False
2   True   True  False
3  False  False   True